Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
        = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250114060856368300000003"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "SPLIT_QUERY_LAMBDA"                   = "sbeacon-backend-splitQuery"
              - "SPLIT_QUERY_TOPIC_ARN"                = "arn:aws:sns:ap-southeast-3:209479276142:splitQuery"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1284265821" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899413273000" -> "1745822345113242000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-0"
        name        = "sbeacon-backend-indexer-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003/*",
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250114060856368300000003"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1963275125" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899548222000" -> "1745822345480954000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:29",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
              - "VARIANTS_BUCKET"                      = "gaspi-variants-20250114060855860000000002"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1027390844" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899816348000" -> "1745822338696782200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "882987626" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780900556596000" -> "1745822345385950000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-1"
        name        = "sbeacon-backend-submitDataset-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003/*",
                          - "arn:aws:s3:::gaspi-metadata-20250114060856368300000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:96601faddf3395e2444c5c3f1340d516f601f0127e6cc9697f8f4ff72cc46382" -> (known after apply)
      ~ last_modified                  = "2025-03-24T01:58:56.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250114060856368300000003"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
              - "REGION"                               = "ap-southeast-3"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-updateFiles:sbeacon-backend-updateFiles"
        name        = "sbeacon-backend-updateFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-vcfs"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:29",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"                        = "gaspi-dataportal-20250120051259130100000001"
              - "DYNAMO_CLINIC_JOBS_PROJECT_NAME_INDEX" = "project-name-index"
              - "DYNAMO_CLINIC_JOBS_TABLE"              = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_PROJECTS_TABLE"                 = "sbeacon-dataportal-projects"
              - "DYNAMO_VCFS_TABLE"                     = "sbeacon-vcfs"
              - "HTS_S3_HOST"                           = "s3.ap-southeast-3.amazonaws.com"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1228683169" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780898785767000" -> "1745822341208594000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/sbeacon.python_libraries_layer/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = null
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/root/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/143/default"
                  + module = ".terraform/modules/sbeacon.python_libraries_layer"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = null
          + "source_path"              = "\"sbeacon/layers/python_libraries/\""
        }
      + result  = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31" -> (known after apply)
      ~ code_sha256                 = "StBe5DcwKBR+0axdNAczyUBLUlFzNyN1YOz3IEG20Bo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-04-22T07:37:46.082+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_bucket                   = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      ~ s3_key                      = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply) # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply) # forces replacement
      ~ source_code_size            = 23699724 -> (known after apply)
      ~ version                     = "31" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250114060855521800000001/builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
      ~ bucket                        = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "137be3af6af0dc29dd46d3737f5d61cd-5" -> (known after apply)
      ~ id                            = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
      ~ key                           = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "478591428" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
          ~ "timestamp" = "1745307259032230000" -> (known after apply)
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41" -> (known after apply)
      ~ code_sha256                 = "3zlBn4K1EldyD5EqFMcdcC5eciVWy3k/1DNw2ZCUJp8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-03-24T01:52:19.526+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:41" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_bucket                   = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 36681 -> (known after apply)
      ~ version                     = "41" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250114060855521800000001/builds/4c759ac6c770aa93ab5a3cecb6e53139bf8189f8e8f20becefb22aa5139b13ea.zip" -> (known after apply)
      ~ bucket                        = "gaspi-lambda-layers-20250114060855521800000001" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "1c81caa0eb2765445c2b575a0930a5d1" -> (known after apply)
      ~ id                            = "builds/4c759ac6c770aa93ab5a3cecb6e53139bf8189f8e8f20becefb22aa5139b13ea.zip" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "683044983" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899732176000" -> "1745822345501796000"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1200695035" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1740987235186741200" -> "1745822334753716000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "ca248e7746c7d3d0f5f86365e2430dda678ef5da"
        }

      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (10 unchanged attributes hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:ea986419475b137c682fcadb8be10192742e8ba426d13d4721304b12a78190c9" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:ea986419475b137c682fcadb8be10192742e8ba426d13d4721304b12a78190c9" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "716b10a05b2379d44cc21d5f1788474a5c9e10c7" -> "ca248e7746c7d3d0f5f86365e2430dda678ef5da"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "78ed10d6b8d3eddb920dd2e5ca875ded72e37c9f"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (10 unchanged attributes hidden)
        }
    }

  # module.svep.module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:36344760b6ad4ba5d2f7346f4d55d2073d00e3f141b91e3be293f6a34b282a7f" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:36344760b6ad4ba5d2f7346f4d55d2073d00e3f141b91e3be293f6a34b282a7f" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "727bb358aa889e56b1f7aaa8ac570353e3bf0cc5" -> "78ed10d6b8d3eddb920dd2e5ca875ded72e37c9f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "346532814" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1744685105752106000" -> "1745822341477561000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.lambda-concatPages.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-concatPages"
        name             = "svep-backend-concatPages"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-concatPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-concatPages"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "CONCATPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "RESULT_SUFFIX"                 = "_results.tsv"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250103055725292400000005"
              - "SVEP_RESULTS"                  = "gaspi-dataportal-20250120051259130100000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_TPJOWHZvH"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-createPages.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-createPages"
        name             = "svep-backend-createPages"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-createPages",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/clinical-workflows/*",
                        ]
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-createPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-createPages"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "CONCATPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages"
              - "CREATEPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-createPages"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250103055725292400000005"
              - "SVEP_RESULTS"                  = "gaspi-dataportal-20250120051259130100000001"
              - "USER_POOL_ID"                  = "ap-southeast-3_TPJOWHZvH"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-getResultsURL.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-getResultsURL"
        name             = "svep-backend-getResultsURL"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-getResultsURL.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-getResultsURL"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "REGION"                     = "ap-southeast-3"
              - "RESULT_DURATION"            = "86400"
              - "RESULT_SUFFIX"              = "_results.tsv"
              - "SVEP_RESULTS"               = "gaspi-dataportal-20250120051259130100000001"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-initQuery.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-initQuery"
        name             = "svep-backend-initQuery"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatStarter",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:ea986419475b137c682fcadb8be10192742e8ba426d13d4721304b12a78190c9" -> (known after apply)
      ~ last_modified                  = "2025-04-25T11:53:41.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "svep-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "svep-backend-qcFigures:svep-backend-qcFigures-0"
        name        = "svep-backend-qcFigures-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:36344760b6ad4ba5d2f7346f4d55d2073d00e3f141b91e3be293f6a34b282a7f" -> (known after apply)
      ~ last_modified                  = "2025-04-25T11:52:07.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "svep-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "FILE_LOCATION"   = "gaspi-dataportal-20250120051259130100000001"
              - "HTS_S3_HOST"     = "s3.ap-southeast-3.amazonaws.com"
              - "RESULT_DURATION" = "86400"
              - "USER_POOL_ID"    = "ap-southeast-3_TPJOWHZvH"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-queryVCF.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-queryVCF"
        name             = "svep-backend-queryVCF"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryVCFsubmit",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryGTF",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "680320269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1744685105104275000" -> "1745822344987022000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1791857466" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1745581691350877000" -> "1745822338296700000"
            # (1 unchanged element hidden)
        }
    }

Plan: 73 to add, 64 to change, 60 to destroy.
╷
│ Error: Archive creation error
╷
│ Warning: Deprecated attribute
│ 
│ 
│   on sbeacon/cloudfront.tf line 45, in resource "aws_cloudfront_distribution" "api_distribution":
│   45:     domain_name = split("/", aws_api_gateway_deployment.BeaconApi.invoke_url)[2]
│   with module.svep.data.archive_file.binaries_layer,
│   on svep/layers.tf line 3, in data "archive_file" "binaries_layer":
│ 
│ The attribute "invoke_url" is deprecated. Refer to the provider
│    3: data "archive_file" "binaries_layer" {
│ 
│ documentation for details.
│ 
│ error creating archive: error archiving directory: could not archive
│ missing directory: svep/layers/binaries/
│ (and 2 more similar warnings elsewhere)
╵
╵


```
</details>